<?php
/**
 * 9开头表示模块 模块编号 信息编号4位 0001
 */
return [
    // query request 公共参数方面
    40001 => '请求的数据不存在',
    40002 => '{0}参数异常',
    40003 => '此数据没有操作权限',
    40004 => '操作失败，请重试',

    // 入口错误代码
    50001 => 'TOKEN无效',
    50002 => '生成TOKEN错误',
    50003 => '数据标识TOKEN无效',
    50004 => '未授权访问, 联系管理员',
    50005 => '访问地址未管理',
    50006 => '查询参数不合法',

    // 文件操作错误代码
    51001 => '总数|分片数错误',
    51002 => '分片{0}上传失败',


    // base模块 1
    // rbac模块 2
    920001 => '请刷新验证码',
    920002 => '验证码错误',
    // spu模块  3
    930001 => '已评论或订单不存在',
    930002 => '未购买此商品',
    // cms模块 4
    // order模块 5
    950001 => '单品或购物车数据无效',
    950002 => '该支付方式未配置',
    950003 => '用户微信消息不存在',
    // payment模块 6
    // shop模块 7
    // member模块 8
    980001 => '小程序获取sessionKey',
    980002 => '小程序新增用户失败',
    980003 => '微信配置错误',
    980004 => '小程序sessionkey错误',
    980005 => '小程序解码错误',
    980006 => '发送成功',
    980007 => '发送失败',
    980008 => '验证码 {0} ',
    980009 => '验证码无效 ',
    // promotion模块 9
    990001 => '优惠券已经领取',
    990002 => '优惠券未到使用时间',
    990003 => '优惠券过期',
    990004 => '优惠券已使用',
    990005 => '优惠券不可同时使用',
];
